{
    "### Modify model information\n> Only supported for small model files extracted from the 'weights' folder.": "### Modifier les informations du modèle\n> Uniquement pris en charge pour les petits fichiers de modèle extraits du dossier 'weights'.",
    "### View model information\n> Only supported for small model files extracted from the 'weights' folder.": "### Afficher les informations sur le modèle\n> Uniquement pour les petits fichiers de modèle extraits du dossier 'weights'.",
    "### Model extraction\n> Enter the path of the large file model under the 'logs' folder.\n\nThis is useful if you want to stop training halfway and manually extract and save a small model file, or if you want to test an intermediate model.": "### Extraction du modèle\n> Saisissez le chemin d'accès au modèle du grand fichier dans le dossier \"logs\".\n\nCette fonction est utile si vous souhaitez arrêter l'entrainement à mi-chemin et extraire et enregistrer manuellement un petit fichier de modèle, ou si vous souhaitez tester un modèle intermédiaire.",
    "### Model comparison\n> You can get model ID (long) from `View model information` below.\n\nCalculate a similarity between two models.": "### Comparaison des modèles\n> Pour obtenir l'ID du modèle (long), veuillez consulter la section `Voir les informations du modèle` ci-dessous.\n\nPeut être utilisé pour comparer la similarité des inférences entre deux modèles.",
    "### Model fusion\nCan be used to test timbre fusion.": "### Fusion de modèles\nPeut être utilisée pour tester la fusion de timbres.",
    "### Step 3. Start training.\nFill in the training settings and start training the model and index.": "### Troisième étape : Commencer l'entraînement\nRemplissez les paramètres d'entraînement, commencez à entraîner le modèle et l'index.",
    "### Step 2. Audio processing. \n#### 1. Slicing.\nAutomatically traverse all files in the training folder that can be decoded into audio and perform slice normalization. Generates 2 wav folders in the experiment directory. Currently, only single-singer/speaker training is supported.": "### Deuxième étape : Traitement audio\n#### 1. Découpage de l'audio\nParcourez automatiquement tous les fichiers qui peuvent être décodés en audio dans le dossier d'entraînement et effectuez le découpage et la normalisation. Deux dossiers wav sont générés dans le répertoire de l'expérience. Pour le moment, seul l'entraînement individuel est pris en charge.",
    "#### 2. Feature extraction.\nUse CPU to extract pitch (if the model has pitch), use GPU to extract features (select GPU index).": "#### 2. Extraction des caractéristiques\nUtilisez le CPU pour extraire la hauteur tonale (si le modèle a une hauteur tonale), utilisez le GPU pour extraire les caractéristiques (sélectionnez le numéro de carte).",
    "If >=3: apply median filtering to the harvested pitch results. The value represents the filter radius and can reduce breathiness.": "Si >=3 : appliquer un filtrage médian aux résultats de la reconnaissance de la hauteur de récolte. La valeur représente le rayon du filtre et peut réduire la respiration.",
    "ID of model A (long)": "ID du modèle A (long)",
    "Weight (w) for Model A": "Poids (w) pour le modèle A :",
    "Path to Model A": "Chemin d'accès au modèle A :",
    "ID of model B (long)": "ID du modèle B (long)",
    "Path to Model B": "Chemin d'accès au modèle B :",
    "F0 curve file (optional). One pitch per line. Replaces the default F0 and pitch modulation": "Fichier de courbe F0 (facultatif). Une hauteur par ligne. Remplace la fréquence fondamentale par défaut et la modulation de la hauteur :",
    "ID(short)": "ID (court)",
    "ID(long)": "ID (long)",
    "None": "Aucun",
    "Export Onnx": "Exporter en ONNX",
    "Onnx Export Path": "Chemin d'exportation ONNX :",
    "RVC Model Path": "Chemin du modèle RVC :",
    "Unknown": "Inconnu",
    "ckpt Processing": "Traitement des fichiers .ckpt",
    "Number of CPU processes used for harvest pitch algorithm": "Nombre de processus CPU utilisés pour l'algorithme de reconnaissance de la hauteur (pitch) dans le cadre de la récolte (harvest).",
    "index path cannot contain unicode characters": "Le chemin du fichier d'index ne doit pas contenir de caractères chinois.",
    "pth path cannot contain unicode characters": "Le chemin du fichier .pth ne doit pas contenir de caractères chinois.",
    "Enter the GPU index(es) separated by '-', e.g., 0-0-1 to use 2 processes in GPU0 and 1 process in GPU1": "Configuration des numéros de carte RMVPE : séparez les index GPU par des tirets \"-\", par exemple, 0-0-1 pour utiliser 2 processus sur GPU0 et 1 processus sur GPU1.",
    "Step 1: Processing data": "Étape 1 : Traitement des données en cours.",
    "step2:Pitch extraction & feature extraction": "Étape 2 : Extraction de la hauteur et extraction des caractéristiques en cours.",
    "Step 3a: Model training started": "Étape 3a : L'entraînement du modèle a commencé.",
    "One-click training": "Entraînement en un clic",
    "Hidden": "Caché",
    "Multiple audio files can also be imported. If a folder path exists, this input is ignored.": "Il est également possible d'importer plusieurs fichiers audio. Si un chemin de dossier existe, cette entrée est ignorée.",
    "Batch processing for vocal accompaniment separation using the UVR5 model.<br>Example of a valid folder path format: D:\\path\\to\\input\\folder (copy it from the file manager address bar).<br>The model is divided into three categories:<br>1. Preserve vocals: Choose this option for audio without harmonies. It preserves vocals better than HP5. It includes two built-in models: HP2 and HP3. HP3 may slightly leak accompaniment but preserves vocals slightly better than HP2.<br>2. Preserve main vocals only: Choose this option for audio with harmonies. It may weaken the main vocals. It includes one built-in model: HP5.<br>3. De-reverb and de-delay models (by FoxJoy):<br>  (1) MDX-Net: The best choice for stereo reverb removal but cannot remove mono reverb;<br>&emsp;(234) DeEcho: Removes delay effects. Aggressive mode removes more thoroughly than Normal mode. DeReverb additionally removes reverb and can remove mono reverb, but not very effectively for heavily reverberated high-frequency content.<br>De-reverb/de-delay notes:<br>1. The processing time for the DeEcho-DeReverb model is approximately twice as long as the other two DeEcho models.<br>2. The MDX-Net-Dereverb model is quite slow.<br>3. The recommended cleanest configuration is to apply MDX-Net first and then DeEcho-Aggressive.": "Traitement en lot pour la séparation de la voix et de l'accompagnement vocal à l'aide du modèle UVR5.<br>Exemple d'un format de chemin de dossier valide : D:\\chemin\\vers\\dossier\\d'entrée (copiez-le depuis la barre d'adresse du gestionnaire de fichiers).<br>Le modèle est divisé en trois catégories :<br>1. Préserver la voix : Choisissez cette option pour l'audio sans harmonies. Elle préserve la voix mieux que HP5. Il comprend deux modèles intégrés : HP2 et HP3. HP3 peut légèrement laisser passer l'accompagnement mais préserve légèrement mieux la voix que HP2.<br>2. Préserver uniquement la voix principale : Choisissez cette option pour l'audio avec harmonies. Cela peut affaiblir la voix principale. Il comprend un modèle intégré : HP5.<br>3. Modèles de suppression de la réverbération et du délai (par FoxJoy) :<br>  (1) MDX-Net : Le meilleur choix pour la suppression de la réverbération stéréo, mais ne peut pas supprimer la réverbération mono.<br>  (234) DeEcho : Supprime les effets de délai. Le mode Aggressive supprime plus efficacement que le mode Normal. DeReverb supprime également la réverbération et peut supprimer la réverbération mono, mais pas très efficacement pour les contenus à haute fréquence fortement réverbérés.<br>Notes sur la suppression de la réverbération et du délai :<br>1. Le temps de traitement pour le modèle DeEcho-DeReverb est environ deux fois plus long que pour les autres deux modèles DeEcho.<br>2. Le modèle MDX-Net-Dereverb est assez lent.<br>3. La configuration la plus propre recommandée est d'appliquer d'abord MDX-Net, puis DeEcho-Aggressive.",
    "Read from model": "Lire à partir du modèle",
    "Enter the GPU index(es) separated by '-', e.g., 0-1-2 to use GPU 0, 1, and 2": "Entrez le(s) index GPU séparé(s) par '-', par exemple, 0-1-2 pour utiliser les GPU 0, 1 et 2 :",
    "Vocals/Accompaniment Separation & Reverberation Removal": "Séparation des voix/accompagnement et suppression de la réverbération",
    "Choose sample rate of the model": "Choisissez la fréquence d'échantillonnage du modèle",
    "Choose sample rate of the device": "Choisissez la fréquence d'échantillonnage de l'appareil",
    "Save name": "Nom de sauvegarde :",
    "Save file name (default: same as the source file)": "Nom du fichier de sauvegarde (par défaut : identique au nom du fichier source) :",
    "Saved model name (without extension)": "Nom du modèle enregistré (sans extension) :",
    "Save frequency (save_every_epoch)": "Fréquence de sauvegarde (save_every_epoch) :",
    "Protect voiceless consonants and breath sounds to prevent artifacts such as tearing in electronic music. Set to 0.5 to disable. Decrease the value to increase protection, but it may reduce indexing accuracy": "Protéger les consonnes sourdes et les bruits de respiration pour éviter les artefacts tels que le déchirement dans la musique électronique. Réglez à 0,5 pour désactiver. Diminuez la valeur pour renforcer la protection, mais cela peut réduire la précision de l'indexation :",
    "Information": "Information",
    "Modify": "Modifier",
    "Stop audio conversion": "Arrêter la conversion audio",
    "All processes have been completed!": "Toutes les étapes ont été terminées !",
    "Resonating offset": "Décalage résonant",
    "Refresh voice list and index path": "Actualiser la liste des voix et le vers l'index.",
    "Load model": "Charger le modèle.",
    "Load pre-trained base model D path": "Charger le chemin du modèle de base pré-entraîné D :",
    "Load pre-trained base model G path": "Charger le chemin du modèle de base pré-entraîné G :",
    "Single inference": "Inférence unique",
    "Unload model to save GPU memory": "Décharger la voix pour économiser la mémoire GPU.",
    "Transpose (integer, number of semitones, raise by an octave: 12, lower by an octave: -12)": "Transposer (entier, nombre de demi-tons, monter d'une octave : 12, descendre d'une octave : -12) :",
    "Resample the output audio in post-processing to the final sample rate. Set to 0 for no resampling": "Rééchantillonner l'audio de sortie en post-traitement à la fréquence d'échantillonnage finale. Réglez sur 0 pour ne pas effectuer de rééchantillonnage :",
    "No": "Non",
    "Enable phase vocoder": "Activer le vocodeur de phase",
    "Response threshold": "Seuil de réponse",
    "loudness factor": "Facteur de volume sonore",
    "Process data": "Traitement des données",
    "Fail": "Raté",
    "Actually calculated": "Effectivement calculé",
    "Export Onnx Model": "Exporter le modèle au format ONNX.",
    "Export file format": "Format de fichier d'exportation",
    "Sealing date": "Date de scellement",
    "FAQ (Frequently Asked Questions)": "FAQ (Foire Aux Questions)",
    "General settings": "Paramètres généraux",
    "Start audio conversion": "Démarrer la conversion audio.",
    "The audio file to be processed": "Le fichier audio à traiter",
    "Unfortunately, there is no compatible GPU available to support your training.": "Malheureusement, il n'y a pas de GPU compatible disponible pour prendre en charge votre entrainement.",
    "Performance settings": "Paramètres de performance",
    "Total training epochs (total_epoch)": "Nombre total d'époques d'entraînement (total_epoch) :",
    "Successfully built index into": "Index intégré avec succès dans",
    "Batch inference": "Inférence par lots",
    "Batch conversion. Enter the folder containing the audio files to be converted or upload multiple audio files. The converted audio will be output in the specified folder (default: 'opt').": "Conversion en lot. Entrez le dossier contenant les fichiers audio à convertir ou téléchargez plusieurs fichiers audio. Les fichiers audio convertis seront enregistrés dans le dossier spécifié (par défaut : 'opt').",
    "Specify the output folder for vocals": "Spécifiez le dossier de sortie pour les fichiers de voix :",
    "Specify output folder": "Spécifiez le dossier de sortie :",
    "Specify the output folder for accompaniment": "Spécifiez le dossier de sortie pour l'accompagnement :",
    "Inference time (ms)": "Temps d'inférence (ms)",
    "Inferencing voice": "Voix pour l'inférence",
    "Extract": "Extraire",
    "Number of CPU processes used for pitch extraction and data processing": "Nombre de processus CPU utilisés pour l'extraction de la hauteur et le traitement des données :",
    "Not exist": "N'existe",
    "Yes": "Oui",
    "Save only the latest '.ckpt' file to save disk space": "Enregistrer uniquement le dernier fichier '.ckpt' pour économiser de l'espace disque :",
    "Save a small final model to the 'weights' folder at each save point": "Enregistrer un petit modèle final dans le dossier 'weights' à chaque point de sauvegarde :",
    "Cache all training sets to GPU memory. Caching small datasets (less than 10 minutes) can speed up training, but caching large datasets will consume a lot of GPU memory and may not provide much speed improvement": "Mettre en cache tous les ensembles d'entrainement dans la mémoire GPU. Mettre en cache de petits ensembles de données (moins de 10 minutes) peut accélérer l'entrainement, mais mettre en cache de grands ensembles de données consommera beaucoup de mémoire GPU et peut ne pas apporter beaucoup d'amélioration de vitesse :",
    "GPU Information": "Informations sur la carte graphique (GPU)",
    "Exist": "Existe",
    "This software is open source under the MIT license. The author does not have any control over the software. Users who use the software and distribute the sounds exported by the software are solely responsible. <br>If you do not agree with this clause, you cannot use or reference any codes and files within the software package. See the root directory <b>Agreement-LICENSE.txt</b> for details.": "Ce logiciel est open source sous la licence MIT. L'auteur n'a aucun contrôle sur le logiciel. Les utilisateurs qui utilisent le logiciel et distribuent les sons exportés par le logiciel en sont entièrement responsables. <br>Si vous n'acceptez pas cette clause, vous ne pouvez pas utiliser ou faire référence à aucun code ni fichier contenu dans le package logiciel. Consultez le fichier <b>Agreement-LICENSE.txt</b> dans le répertoire racine pour plus de détails.",
    "View": "Voir",
    "Search feature ratio (controls accent strength, too high has artifacting)": "Rapport de recherche de caractéristiques (contrôle l'intensité de l'accent, un rapport trop élevé provoque des artefacts) :",
    "Model": "Modèle",
    "Model Author": "Auteur du modèle",
    "Model Author (Nullable)": "Auteur du modèle (Nullable)",
    "Model info": "Informations sur le modèle",
    "Model name": "Nom du modèle",
    "Model Inference": "Inférence du modèle",
    "Whether the model has pitch guidance": "Indique si le modèle dispose d'un guidage en hauteur :",
    "Whether the model has pitch guidance (required for singing, optional for speech)": "Indique si le modèle dispose d'un système de guidage de la hauteur (obligatoire pour le chant, facultatif pour la parole) :",
    "Whether the model has pitch guidance (1: yes, 0: no)": "Le modèle dispose-t-il d'un guide de hauteur (1 : oui, 0 : non) ?",
    "Model architecture version": "Version de l'architecture du modèle :",
    "Path to Model": "Le chemin vers le modèle :",
    "Batch size per GPU": "Taille du batch par GPU :",
    "Fade length": "Longueur de la transition",
    "Version": "Version",
    "Feature extraction": "Extraction des caractéristiques",
    "Path to the feature index file. Leave blank to use the selected result from the dropdown": "Chemin d'accès au fichier d'index des caractéristiques. Laisser vide pour utiliser le résultat sélectionné dans la liste déroulante :",
    "Takeover WASAPI device": "Reprise du périphérique WASAPI",
    "Target sample rate": "Taux d'échantillonnage cible :",
    "Similarity": "Similarité",
    "Similarity (from 0 to 1)": "Similarité (de 0 à 1)",
    "Algorithmic delays (ms)": "Délais algorithmiques (ms)",
    "Auto-detect index path and select from the dropdown": "Détecter automatiquement le chemin d'accès à l'index et le sélectionner dans la liste déroulante :",
    "Fusion": "Fusion",
    "Model information to be modified": "Informations sur le modèle à modifier :",
    "Model information to be placed": "Informations sur le modèle à placer :",
    "Calculate": "Calculez-le",
    "Train": "Entraîner",
    "Train model": "Entraîner le modèle",
    "Train feature index": "Entraîner l'index des caractéristiques",
    "Training complete. You can check the training logs in the console or the 'train.log' file under the experiment folder.": "Entraînement terminé. Vous pouvez consulter les rapports d'entraînement dans la console ou dans le fichier 'train.log' situé dans le dossier de l'expérience.",
    "Device type": "Type d'appareil",
    "Please specify the speaker/singer ID": "Veuillez spécifier l'ID de l'orateur ou du chanteur :",
    "Please choose the .index file": "Veuillez sélectionner le fichier d'index",
    "Please choose the .pth file": "Veuillez sélectionner le fichier pth",
    "Select Speaker/Singer ID": "Sélectionner l'ID de l'orateur ou du chanteur :",
    "Convert": "Convertir",
    "Enter the experiment name": "Saisissez le nom de l'expérience :",
    "Enter the path of the audio folder to be processed": "Entrez le chemin du dossier audio à traiter :",
    "Enter the path of the audio folder to be processed (copy it from the address bar of the file manager)": "Entrez le chemin du dossier audio à traiter (copiez-le depuis la barre d'adresse du gestionnaire de fichiers) :",
    "Adjust the volume envelope scaling. Closer to 0, the more it mimicks the volume of the original vocals. Can help mask noise and make volume sound more natural when set relatively low. Closer to 1 will be more of a consistently loud volume": "Ajustez l'échelle de l'enveloppe de volume. Plus il est proche de 0, plus il imite le volume des voix originales. Cela peut aider à masquer les bruits et à rendre le volume plus naturel lorsqu'il est réglé relativement bas. Plus le volume est proche de 1, plus le volume sera fort et constant :",
    "Input voice monitor": "Moniteur vocal d'entrée",
    "Enter the path of the training folder": "Indiquez le chemin d'accès au dossier d'entraînement :",
    "Input device": "Dispositif d'entrée",
    "Input noise reduction": "Réduction du bruit d'entrée",
    "Output information": "Informations sur la sortie",
    "Output converted voice": "Sortie voix convertie",
    "Output device": "Dispositif de sortie",
    "Output noise reduction": "Réduction du bruit de sortie",
    "Export audio (click on the three dots in the lower right corner to download)": "Exporter l'audio (cliquer sur les trois points dans le coin inférieur droit pour télécharger)",
    "Select the .index file": "Sélectionner le fichier .index",
    "Select the .pth file": "Sélectionner le fichier .pth",
    "Select the pitch extraction algorithm ('pm': faster extraction but lower-quality speech; 'harvest': better bass but extremely slow; 'crepe': better quality but GPU intensive), 'rmvpe': best quality, and little GPU requirement": "Sélectionnez l'algorithme d'extraction de la hauteur de ton (\"pm\" : extraction plus rapide mais parole de moindre qualité ; \"harvest\" : meilleure basse mais extrêmement lente ; \"crepe\" : meilleure qualité mais utilisation intensive du GPU), \"rmvpe\" : meilleure qualité et peu d'utilisation du GPU.",
    "Select the pitch extraction algorithm: when extracting singing, you can use 'pm' to speed up. For high-quality speech with fast performance, but worse CPU usage, you can use 'dio'. 'harvest' results in better quality but is slower.  'rmvpe' has the best results and consumes less CPU/GPU": "Sélection de l'algorithme d'extraction de la hauteur : la chanson d'entrée peut être traitée plus rapidement par pm, avec une voix de haute qualité mais un CPU médiocre, par dio, harvest est meilleur mais plus lent, rmvpe est le meilleur, mais consomme légèrement le CPU/GPU.",
    "Sampling rate": "Taux d'échantillonnage",
    "Sample length": "Longueur de l'échantillon",
    "Reload device list": "Recharger la liste des dispositifs",
    "Link index to outside folder": "Lier l'index au dossier extérieur",
    "Pitch settings": "Réglages de la hauteur",
    "Audio device": "Périphérique audio",
    "Pitch guidance (f0)": "Guidage du pas (f0)",
    "Pitch detection algorithm": "Algorithme de détection de la hauteur",
    "Extra inference time": "Temps d'inférence supplémentaire"
}