{
    "### Model extraction\n> Enter the path of the large file model under the 'logs' folder.\n\nThis is useful if you want to stop training halfway and manually extract and save a small model file, or if you want to test an intermediate model.": "### Model çıkartma\n> Büyük dosya modeli yolunu 'logs' klasöründe girin.\n\nBu, eğitimi yarıda bırakmak istediğinizde ve manuel olarak küçük bir model dosyası çıkartmak ve kaydetmek istediğinizde veya bir ara modeli test etmek istediğinizde kullanışlıdır.",
    "### Model fusion\nCan be used to test timbre fusion.### Step 1. Fill in the experimental configuration.\nExperimental data is stored in the 'logs' folder, with each experiment having a separate folder. Manually enter the experiment name path, which contains the experimental configuration, logs, and trained model files.": "### Model fusion\nCan be used to test timbre fusion.### Step 1. Fill in the experimental configuration.\nExperimental data is stored in the 'logs' folder, with each experiment having a separate folder. Manually enter the experiment name path, which contains the experimental configuration, logs, and trained model files.",
    "### Modify model information\n> Only supported for small model files extracted from the 'weights' folder.": "### Model bilgilerini düzenle\n> Sadece 'weights' klasöründen çıkarılan küçük model dosyaları desteklenir.",
    "### Step 2. Audio processing. \n#### 1. Slicing.\nAutomatically traverse all files in the training folder that can be decoded into audio and perform slice normalization. Generates 2 wav folders in the experiment directory. Currently, only single-singer/speaker training is supported.": "### 第二步 音频处理\n#### 1. 音频切片\n自动遍历训练文件夹下所有可解码成音频的文件并进行切片归一化, 在实验目录下生成2个wav文件夹; 暂时只支持单人训练.",
    "### Step 3. Start training.\nFill in the training settings and start training the model and index.": "### 第三步 开始训练\n填写训练设置, 开始训练模型和索引.",
    "### View model information\n> Only supported for small model files extracted from the 'weights' folder.": "### Model bilgilerini görüntüle\n> Sadece 'weights' klasöründen çıkarılan küçük model dosyaları desteklenir.",
    "#### 2. Feature extraction.\nUse CPU to extract pitch (if the model has pitch), use GPU to extract features (select GPU index).": "#### 2. 特征提取\n使用CPU提取音高(如果模型带音高), 使用GPU提取特征(选择卡号).",
    "Actually calculated": "实际计算",
    "Adjust the volume envelope scaling. Closer to 0, the more it mimicks the volume of the original vocals. Can help mask noise and make volume sound more natural when set relatively low. Closer to 1 will be more of a consistently loud volume": "Sesin hacim zarfını ayarlayın. 0'a yakın değerler, sesin orijinal vokallerin hacmine benzer olmasını sağlar. Düşük bir değerle ses gürültüsünü maskeleyebilir ve hacmi daha doğal bir şekilde duyulabilir hale getirebilirsiniz. 1'e yaklaştıkça sürekli bir yüksek ses seviyesi elde edilir:",
    "Algorithmic delays (ms)": "算法延迟(ms)",
    "All processes have been completed!": "Tüm işlemler tamamlandı!",
    "Audio device": "Ses cihazı",
    "Auto-detect index path and select from the dropdown": "İndeks yolunu otomatik olarak tespit et ve açılır menüden seçim yap.",
    "Batch conversion. Enter the folder containing the audio files to be converted or upload multiple audio files. The converted audio will be output in the specified folder (default: 'opt').": "Toplu dönüştür. Dönüştürülecek ses dosyalarının bulunduğu klasörü girin veya birden çok ses dosyasını yükleyin. Dönüştürülen ses dosyaları belirtilen klasöre ('opt' varsayılan olarak) dönüştürülecektir",
    "Batch inference": "批量推理",
    "Batch processing for vocal accompaniment separation using the UVR5 model.<br>Example of a valid folder path format: D:\\path\\to\\input\\folder (copy it from the file manager address bar).<br>The model is divided into three categories:<br>1. Preserve vocals: Choose this option for audio without harmonies. It preserves vocals better than HP5. It includes two built-in models: HP2 and HP3. HP3 may slightly leak accompaniment but preserves vocals slightly better than HP2.<br>2. Preserve main vocals only: Choose this option for audio with harmonies. It may weaken the main vocals. It includes one built-in model: HP5.<br>3. De-reverb and de-delay models (by FoxJoy):<br>  (1) MDX-Net: The best choice for stereo reverb removal but cannot remove mono reverb;<br>&emsp;(234) DeEcho: Removes delay effects. Aggressive mode removes more thoroughly than Normal mode. DeReverb additionally removes reverb and can remove mono reverb, but not very effectively for heavily reverberated high-frequency content.<br>De-reverb/de-delay notes:<br>1. The processing time for the DeEcho-DeReverb model is approximately twice as long as the other two DeEcho models.<br>2. The MDX-Net-Dereverb model is quite slow.<br>3. The recommended cleanest configuration is to apply MDX-Net first and then DeEcho-Aggressive.": "Batch işleme kullanarak vokal eşlik ayrımı için UVR5 modeli kullanılır.<br>Geçerli bir klasör yol formatı örneği: D:\\path\\to\\input\\folder (dosya yöneticisi adres çubuğundan kopyalanır).<br>Model üç kategoriye ayrılır:<br>1. Vokalleri koru: Bu seçeneği, harmoni içermeyen sesler için kullanın. HP5'ten daha iyi bir şekilde vokalleri korur. İki dahili model içerir: HP2 ve HP3. HP3, eşlik sesini hafifçe sızdırabilir, ancak vokalleri HP2'den biraz daha iyi korur.<br>2. Sadece ana vokalleri koru: Bu seçeneği, harmoni içeren sesler için kullanın. Ana vokalleri zayıflatabilir. Bir dahili model içerir: HP5.<br>3. Reverb ve gecikme modelleri (FoxJoy tarafından):<br>  (1) MDX-Net: Stereo reverb'i kaldırmak için en iyi seçenek, ancak mono reverb'i kaldıramaz;<br> (234) DeEcho: Gecikme efektlerini kaldırır. Agresif mod, Normal moda göre daha kapsamlı bir şekilde kaldırma yapar. DeReverb ayrıca reverb'i kaldırır ve mono reverb'i kaldırabilir, ancak yoğun yankılı yüksek frekanslı içerikler için çok etkili değildir.<br>Reverb/gecikme notları:<br>1. DeEcho-DeReverb modelinin işleme süresi diğer iki DeEcho modeline göre yaklaşık olarak iki kat daha uzundur.<br>2. MDX-Net-Dereverb modeli oldukça yavaştır.<br>3. Tavsiye edilen en temiz yapılandırma önce MDX-Net'i uygulamak ve ardından DeEcho-Aggressive uygulamaktır.",
    "Batch size per GPU": "Her GPU için yığın boyutu (batch_size):",
    "Cache all training sets to GPU memory. Caching small datasets (less than 10 minutes) can speed up training, but caching large datasets will consume a lot of GPU memory and may not provide much speed improvement": "Tüm eğitim verilerini GPU belleğine önbelleğe alıp almayacağınızı belirtin. Küçük veri setlerini (10 dakikadan az) önbelleğe almak eğitimi hızlandırabilir, ancak büyük veri setlerini önbelleğe almak çok fazla GPU belleği tüketir ve çok fazla hız artışı sağlamaz:",
    "Calculate": "计算",
    "Choose sample rate of the device": "使用设备采样率",
    "Choose sample rate of the model": "使用模型采样率",
    "Convert": "Dönüştür",
    "Device type": "设备类型",
    "Enable phase vocoder": "启用相位声码器",
    "Enter the GPU index(es) separated by '-', e.g., 0-0-1 to use 2 processes in GPU0 and 1 process in GPU1": "rmvpe卡号配置：以-分隔输入使用的不同进程卡号,例如0-0-1使用在卡0上跑2个进程并在卡1上跑1个进程",
    "Enter the GPU index(es) separated by '-', e.g., 0-1-2 to use GPU 0, 1, and 2": "GPU indekslerini '-' ile ayırarak girin, örneğin 0-1-2, GPU 0, 1 ve 2'yi kullanmak için:",
    "Enter the experiment name": "Deneysel adı girin:",
    "Enter the path of the audio folder to be processed": "İşlenecek ses klasörünün yolunu girin:",
    "Enter the path of the audio folder to be processed (copy it from the address bar of the file manager)": "İşlenecek ses klasörünün yolunu girin (dosya yöneticisinin adres çubuğundan kopyalayın):",
    "Enter the path of the training folder": "Eğitim klasörünün yolunu girin:",
    "Exist": "有",
    "Export Onnx": "Onnx Dışa Aktar",
    "Export Onnx Model": "Onnx Modeli Dışa Aktar",
    "Export audio (click on the three dots in the lower right corner to download)": "Ses dosyasını dışa aktar (indirmek için sağ alt köşedeki üç noktaya tıklayın)",
    "Export file format": "Dışa aktarma dosya formatı",
    "Extra inference time": "Ekstra çıkartma süresi",
    "Extract": "Çıkart",
    "F0 curve file (optional). One pitch per line. Replaces the default F0 and pitch modulation": "F0 eğrisi dosyası (isteğe bağlı). Her satırda bir pitch değeri bulunur. Varsayılan F0 ve pitch modülasyonunu değiştirir:",
    "FAQ (Frequently Asked Questions)": "Sıkça Sorulan Sorular (SSS)",
    "Fade length": "Geçiş (Fade) uzunluğu",
    "Fail": "失败",
    "Feature extraction": "Özellik çıkartma",
    "Formant offset": "共振偏移",
    "Fusion": "Birleştir",
    "GPU Information": "GPU Bilgisi",
    "General settings": "Genel ayarlar",
    "Hidden": "不显示",
    "ID of model A (long)": "A模型ID(长)",
    "ID of model B (long)": "B模型ID(长)",
    "ID(short)": "ID(短)",
    "ID(长)": "ID(长)",
    "If >=3: apply median filtering to the harvested pitch results. The value represents the filter radius and can reduce breathiness.": "Eğer >=3 ise, elde edilen pitch sonuçlarına median filtreleme uygula. Bu değer, filtre yarıçapını temsil eder ve nefesliliği azaltabilir.",
    "Inference time (ms)": "Çıkarsama süresi (ms)",
    "Inferencing voice": "Ses çıkartma (Inference):",
    "Information": "信息",
    "Input device": "Giriş cihazı",
    "Input noise reduction": "Giriş gürültü azaltma",
    "Input voice monitor": "输入监听",
    "Link index to outside folder": "链接索引到外部",
    "Load model": "Model yükle",
    "Load pre-trained base model D path": "Önceden eğitilmiş temel D modelini yükleme yolu:",
    "Load pre-trained base model G path": "Önceden eğitilmiş temel G modelini yükleme yolu:",
    "Loudness factor": "ses yüksekliği faktörü",
    "Model": "Model",
    "Model Author": "模型作者",
    "Model Author (Nullable)": "模型作者(可空)",
    "Model Inference": "Model çıkartma (Inference)",
    "Model architecture version": "Model mimari versiyonu:",
    "Model info": "模型信息",
    "Model information to be modified": "Düzenlenecek model bilgileri:",
    "Model information to be placed": "Eklemek için model bilgileri:",
    "Model name": "模型名",
    "Modify": "Düzenle",
    "Multiple audio files can also be imported. If a folder path exists, this input is ignored.": "Ses dosyaları ayrıca toplu olarak, iki seçimle, öncelikli okuma klasörüyle içe aktarılabilir",
    "No": "Hayır",
    "None": "None",
    "Not exist": "无",
    "Number of CPU processes used for harvest pitch algorithm": "harvest进程数",
    "Number of CPU processes used for pitch extraction and data processing": "Ses yüksekliği çıkartmak (Pitch) ve verileri işlemek için kullanılacak CPU işlemci sayısı:",
    "One-click training": "Tek Tuşla Eğit",
    "Onnx Export Path": "Onnx Dışa Aktarım Yolu:",
    "Output converted voice": "输出变声",
    "Output device": "Çıkış cihazı",
    "Output information": "Çıkış bilgisi",
    "Output noise reduction": "Çıkış gürültü azaltma",
    "Path to Model": "Model Yolu:",
    "Path to Model A": "A Modeli Yolu:",
    "Path to Model B": "B Modeli Yolu:",
    "Path to the feature index file. Leave blank to use the selected result from the dropdown": "Özellik indeksi dosyasının yolunu belirtin. Seçilen sonucu kullanmak için boş bırakın veya açılır menüden seçim yapın.",
    "Performance settings": "Performans ayarları",
    "Pitch detection algorithm": "音高算法",
    "Pitch guidance (f0)": "音高引导(f0)",
    "Pitch settings": "Pitch ayarları",
    "Please choose the .index file": "Lütfen .index dosyası seçin",
    "Please choose the .pth file": "Lütfen .pth dosyası seçin",
    "Please specify the speaker/singer ID": "Lütfen konuşmacı/sanatçı no belirtin:",
    "Process data": "Verileri işle",
    "Protect voiceless consonants and breath sounds to prevent artifacts such as tearing in electronic music. Set to 0.5 to disable. Decrease the value to increase protection, but it may reduce indexing accuracy": "Sessiz ünsüzleri ve nefes seslerini koruyarak elektronik müzikte yırtılma gibi sanal hataların oluşmasını engeller. 0.5 olarak ayarlandığında devre dışı kalır. Değerin azaltılması korumayı artırabilir, ancak indeksleme doğruluğunu azaltabilir:",
    "RVC Model Path": "RVC Model Yolu:",
    "Read from model": "从模型中读取",
    "Refresh voice list and index path": "Ses listesini ve indeks yolunu yenile",
    "Reload device list": "Cihaz listesini yeniden yükle",
    "Resample the output audio in post-processing to the final sample rate. Set to 0 for no resampling": "Son işleme aşamasında çıktı sesini son örnekleme hızına yeniden örnekle. 0 değeri için yeniden örnekleme yapılmaz:",
    "Response threshold": "Tepki eşiği",
    "Sample length": "Örnekleme uzunluğu",
    "Sampling rate": "采样率",
    "Save a small final model to the 'weights' folder at each save point": "Her kaydetme noktasında son küçük bir modeli 'weights' klasörüne kaydetmek için:",
    "Save file name (default: same as the source file)": "Kaydedilecek dosya adı (varsayılan: kaynak dosya ile aynı):",
    "Save frequency (save_every_epoch)": "Kaydetme sıklığı (save_every_epoch):",
    "Save name": "Kaydetme Adı:",
    "Save only the latest '.ckpt' file to save disk space": "Sadece en son '.ckpt' dosyasını kaydet:",
    "Saved model name (without extension)": "Kaydedilecek model adı (uzantı olmadan):",
    "Sealing date": "封装时间",
    "Search feature ratio (controls accent strength, too high has artifacting)": "Arama özelliği oranı (vurgu gücünü kontrol eder, çok yüksek olması sanal etkilere neden olur)",
    "Select Speaker/Singer ID": "Konuşmacı/Şarkıcı No seçin:",
    "Select the .index file": ".index dosyası seç",
    "Select the .pth file": ".pth dosyası seç",
    "Select the pitch extraction algorithm ('pm': faster extraction but lower-quality speech; 'harvest': better bass but extremely slow; 'crepe': better quality but GPU intensive), 'rmvpe': best quality, and little GPU requirement": "Pitch algoritmasını seçin ('pm': daha hızlı çıkarır ancak daha düşük kaliteli konuşma; 'harvest': daha iyi konuşma sesi ancak son derece yavaş; 'crepe': daha da iyi kalite ancak GPU yoğunluğu gerektirir):",
    "Select the pitch extraction algorithm: when extracting singing, you can use 'pm' to speed up. For high-quality speech with fast performance, but worse CPU usage, you can use 'dio'. 'harvest' results in better quality but is slower.  'rmvpe' has the best results and consumes less CPU/GPU": "选择音高提取算法:输入歌声可用pm提速,高质量语音但CPU差可用dio提速,harvest质量更好但慢,rmvpe效果最好且微吃CPU/GPU",
    "Similarity": "相似度",
    "Similarity (from 0 to 1)": "相似度(0到1)",
    "Single inference": "单次推理",
    "Specify output folder": "Çıkış klasörünü belirt:",
    "Specify the output folder for accompaniment": "Müzik ve diğer sesler için çıkış klasörünü belirtin:",
    "Specify the output folder for vocals": "Vokal için çıkış klasörünü belirtin:",
    "Start audio conversion": "Ses dönüştürmeyi başlat",
    "Step 1: Processing data": "Adım 1: Veri işleme",
    "Step 3a: Model training started": "Adım 3a: Model eğitimi başladı",
    "Stop audio conversion": "Ses dönüştürmeyi durdur",
    "Successfully built index into": "成功构建索引到",
    "Takeover WASAPI device": "独占 WASAPI 设备",
    "Target sample rate": "Hedef örnekleme oranı:",
    "The audio file to be processed": "待处理音频文件",
    "This software is open source under the MIT license. The author does not have any control over the software. Users who use the software and distribute the sounds exported by the software are solely responsible. <br>If you do not agree with this clause, you cannot use or reference any codes and files within the software package. See the root directory <b>Agreement-LICENSE.txt</b> for details.": "Bu yazılım, MIT lisansı altında açık kaynaklıdır. Yazarın yazılım üzerinde herhangi bir kontrolü yoktur. Yazılımı kullanan ve yazılım tarafından dışa aktarılan sesleri dağıtan kullanıcılar sorumludur. <br>Eğer bu maddeyle aynı fikirde değilseniz, yazılım paketi içindeki herhangi bir kod veya dosyayı kullanamaz veya referans göremezsiniz. Detaylar için kök dizindeki <b>Agreement-LICENSE.txt</b> dosyasına bakınız.",
    "Total training epochs (total_epoch)": "Toplam eğitim turu (total_epoch):",
    "Train": "Eğitim",
    "Train feature index": "Özellik Dizinini Eğit",
    "Train model": "Modeli Eğit",
    "Training complete. You can check the training logs in the console or the 'train.log' file under the experiment folder.": "Eğitim tamamlandı. Eğitim günlüklerini konsolda veya deney klasörü altındaki train.log dosyasında kontrol edebilirsiniz.",
    "Transpose (integer, number of semitones, raise by an octave: 12, lower by an octave: -12)": "Transpoze et (tamsayı, yarıton sayısıyla; bir oktav yükseltmek için: 12, bir oktav düşürmek için: -12):",
    "Unfortunately, there is no compatible GPU available to support your training.": "Maalesef, eğitiminizi desteklemek için uyumlu bir GPU bulunmamaktadır.",
    "Unknown": "Unknown",
    "Unload model to save GPU memory": "GPU bellek kullanımını azaltmak için sesi kaldır",
    "Version": "Sürüm",
    "View": "Görüntüle",
    "Vocals/Accompaniment Separation & Reverberation Removal": "Vokal/Müzik Ayrıştırma ve Yankı Giderme",
    "Weight (w) for Model A": "A Modeli Ağırlığı:",
    "Whether the model has pitch guidance": "Modelin ses yüksekliği rehberi içerip içermediği:",
    "Whether the model has pitch guidance (1: yes, 0: no)": "Modelin ses yüksekliği rehberi içerip içermediği (1: evet, 0: hayır):",
    "Whether the model has pitch guidance (required for singing, optional for speech)": "Modelin ses yüksekliği (Pitch) rehberliği içerip içermediği (şarkı söyleme için şarttır, konuşma için isteğe bağlıdır):",
    "Yes": "Evet",
    "ckpt Processing": "ckpt İşleme",
    "index path cannot contain unicode characters": ".index dosya yolu Çince karakter içeremez",
    "pth path cannot contain unicode characters": ".pth dosya yolu Çince karakter içeremez",
    "step2:Pitch extraction & feature extraction": "step2:正在提取音高&正在提取特征"
}
